doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-09 Sun 09:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assignment 1</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Assignment 1
<br />
<span class="subtitle">Logic in computer science</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org776e5f8">1. Converting infix to prefix expression</a>
<ul>
<li><a href="#org45c8011">1.1. Algorithm</a></li>
<li><a href="#org0ce807d">1.2. Final function</a></li>
</ul>
</li>
<li><a href="#org1b518fa">2. Converting the prefix expression to a rooted binary parse tree</a>
<ul>
<li><a href="#orga368723">2.1. Algorithm</a></li>
<li><a href="#org180614e">2.2. Final function</a></li>
</ul>
</li>
<li><a href="#org23e6647">3. Outputting the infix expression by in-order traversal</a></li>
<li><a href="#org8f85ac4">4. Computing the height of the parse tree</a></li>
<li><a href="#org3577ee9">5. Evaluating the truth value of a propositional logic formula</a>
<ul>
<li><a href="#orgc3c8cf7">5.1. Algorithm</a></li>
<li><a href="#orgf0e5f20">5.2. Final function</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Group Members:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">ID</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Sabyasachi Bhoi</td>
<td class="org-left">2020B3A72147H</td>
</tr>

<tr>
<td class="org-left">Chinmay Anand</td>
<td class="org-left">2020B3A70776H</td>
</tr>

<tr>
<td class="org-left">Arya Singalwar</td>
<td class="org-left">2020B3A71861H</td>
</tr>

<tr>
<td class="org-left">Dhruv Deshmukh</td>
<td class="org-left">2020B3A72160H</td>
</tr>
</tbody>
</table>

<div id="outline-container-org776e5f8" class="outline-2">
<h2 id="org776e5f8"><span class="section-number-2">1.</span> Converting infix to prefix expression</h2>
<div class="outline-text-2" id="text-1">
<p>
The precedence order of all the operations are as follows:
</p>

<pre class="example">
~ &gt; * &gt; + &gt; (&gt;)
</pre>

<p>
In order to convert an infix propositional logic expresson to a prefix expression, we make use of the <b>Stack</b> data structure.
</p>
</div>

<div id="outline-container-org45c8011" class="outline-3">
<h3 id="org45c8011"><span class="section-number-3">1.1.</span> Algorithm</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><p>
Initialize an empty stack and an <code>ans</code> variable to keep track of the final answer.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ffc777;">stack</span><span style="color: #c099ff;">&lt;</span><span style="color: #ffc777;">char</span><span style="color: #c099ff;">&gt;</span> <span style="color: #ff98a4;">st</span>;
<span style="color: #ffc777;">string</span> <span style="color: #ff98a4;">ans</span> = <span style="color: #c3e88d;">""</span>;
</pre>
</div></li>

<li><p>
Define a hashmap to keep track of the precedence order of all the operators:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ffc777;">unordered_map</span><span style="color: #c099ff;">&lt;</span><span style="color: #ffc777;">char</span>, <span style="color: #ffc777;">int</span><span style="color: #c099ff;">&gt;</span> <span style="color: #ff98a4;">operators</span> = <span style="color: #c099ff;">{</span><span style="color: #ff995e;">{</span><span style="color: #c3e88d;">'&gt;'</span>, 1<span style="color: #ff995e;">}</span>, <span style="color: #ff995e;">{</span><span style="color: #c3e88d;">'+'</span>, 2<span style="color: #ff995e;">}</span>, <span style="color: #ff995e;">{</span><span style="color: #c3e88d;">'*'</span>, 3<span style="color: #ff995e;">}</span>, <span style="color: #ff995e;">{</span><span style="color: #c3e88d;">'~'</span>, 4<span style="color: #ff995e;">}</span><span style="color: #c099ff;">}</span>;
</pre>
</div></li>

<li><p>
Reverse the original infix expression.
</p>
<div class="org-src-container">
<pre class="src src-c++">reverse<span style="color: #c099ff;">(</span>s.begin<span style="color: #ff995e;">()</span>, s.end<span style="color: #ff995e;">()</span><span style="color: #c099ff;">)</span>;
</pre>
</div></li>

<li>Traverse through the expression:
<ol class="org-ol">
<li>If the current character is propositional atom, append it to the output string.</li>
<li>If the current character is an operator, check the precedence order:
<ol class="org-ol">
<li>If it has higher or equal precedence than the topmost element of the stack, then push it onto the stack.</li>
<li>otherwise, pop the topmost operator on the stack, append it to the output string, and push the current operator onto the stack.</li>
</ol></li>
</ol></li>
<li>For dealing with parenthesis:
<ol class="org-ol">
<li>If you encounter a closing parenthesis, push it onto the stack.</li>
<li><p>
If you encounter an opening parenthesis, keeping popping operators from the stack till you encounter a closing parenthesis, and keep appending these operators to the output string.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c099ff;">for</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">char</span> <span style="color: #ff98a4;">c</span> : s<span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">if</span><span style="color: #ff995e;">(</span>operators.find<span style="color: #ff98a4;">(</span>c<span style="color: #ff98a4;">)</span> != operators.end<span style="color: #ff98a4;">()</span><span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
    <span style="color: #c099ff;">if</span><span style="color: #ff98a4;">(</span>st.empty<span style="color: #b4f9f8;">()</span> || operators<span style="color: #b4f9f8;">[</span>c<span style="color: #b4f9f8;">]</span> &gt; operators<span style="color: #b4f9f8;">[</span>st.top<span style="color: #f989d3;">()</span><span style="color: #b4f9f8;">]</span><span style="color: #ff98a4;">)</span> st.push<span style="color: #ff98a4;">(</span>c<span style="color: #ff98a4;">)</span>;
    <span style="color: #c099ff;">else</span> <span style="color: #ff98a4;">{</span>
        ans.push_back<span style="color: #b4f9f8;">(</span>st.top<span style="color: #f989d3;">()</span><span style="color: #b4f9f8;">)</span>;
        st.pop<span style="color: #b4f9f8;">()</span>;
        st.push<span style="color: #b4f9f8;">(</span>c<span style="color: #b4f9f8;">)</span>;
    <span style="color: #ff98a4;">}</span>
    <span style="color: #ff995e;">}</span>
    <span style="color: #c099ff;">else</span> <span style="color: #c099ff;">if</span><span style="color: #ff995e;">(</span>c == <span style="color: #c3e88d;">')'</span><span style="color: #ff995e;">)</span> st.push<span style="color: #ff995e;">(</span>c<span style="color: #ff995e;">)</span>;
    <span style="color: #c099ff;">else</span> <span style="color: #c099ff;">if</span><span style="color: #ff995e;">(</span>c == <span style="color: #c3e88d;">'('</span><span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
    <span style="color: #c099ff;">while</span><span style="color: #ff98a4;">(</span>st.top<span style="color: #b4f9f8;">()</span> != <span style="color: #c3e88d;">')'</span><span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">{</span>
        ans.push_back<span style="color: #b4f9f8;">(</span>st.top<span style="color: #f989d3;">()</span><span style="color: #b4f9f8;">)</span>;
        st.pop<span style="color: #b4f9f8;">()</span>;
    <span style="color: #ff98a4;">}</span>
    st.pop<span style="color: #ff98a4;">()</span>;
    <span style="color: #ff995e;">}</span>
    <span style="color: #c099ff;">else</span> ans.push_back<span style="color: #ff995e;">(</span>c<span style="color: #ff995e;">)</span>;
<span style="color: #c099ff;">}</span>
</pre>
</div></li>
</ol></li>

<li><p>
Once you reach the end of the expression, pop all the operators from the stack and append them to the output string.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c099ff;">while</span><span style="color: #c099ff;">(</span><span style="color: #86e1fc; font-weight: bold;">!</span>st.empty<span style="color: #ff995e;">()</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    ans.push_back<span style="color: #ff995e;">(</span>st.top<span style="color: #ff98a4;">()</span><span style="color: #ff995e;">)</span>;
    st.pop<span style="color: #ff995e;">()</span>;
<span style="color: #c099ff;">}</span>
</pre>
</div></li>

<li><p>
Reverse the output string to get the final prefix expression.
</p>
<div class="org-src-container">
<pre class="src src-c++">reverse<span style="color: #c099ff;">(</span>ans.begin<span style="color: #ff995e;">()</span>, ans.end<span style="color: #ff995e;">()</span><span style="color: #c099ff;">)</span>;
</pre>
</div></li>
</ol>
</div>
</div>
