doc.org
** Final function
#+begin_src c++
string infixToPrefix(string s) {
  stack<char> st;
  reverse(s.begin(), s.end());

  unordered_map<char, int> operators = {{'>', 1}, {'+', 2}, {'*', 3}, {'~', 4}};
  string ans = "";

  for(char c : s) {
	if(c == ' ') continue;
	if(operators.find(c) != operators.end()) {
	  if(st.empty() || operators[c] > operators[st.top()]) st.push(c);
	  else {
		ans.push_back(st.top());
		st.pop();
		st.push(c);
	  }
	}
	else if(c == ')') st.push(c);
	else if(c == '(') {
	  while(st.top() != ')') {
		ans.push_back(st.top());
		st.pop();
	  }
	  st.pop();
	}
	else ans.push_back(c);
  }

  while(!st.empty()) {
	ans.push_back(st.top());
	st.pop();
  }

  reverse(ans.begin(), ans.end());
  return ans;
}
#+end_src

* Converting the prefix expression to a rooted binary parse tree
First we define a =Node= structure to denote the nodes of the binary tree:
#+begin_src c++
  struct Node {
    char data;
    struct Node *left;
    struct Node *right;
  
    Node (char x) : data(x), left(nullptr), right(nullptr) {}
  };
#+end_src

For actually converting the given prefix expression to a rooted binary parse tree, we're going to employ a recursive algorithm which takes
- the prefix expression as a string,
- the starting index of the string, and
- the ending index of the string
as arguments. 

The function is going to return two values:
- the root node of the parse tree, and
- the index of string where the tree ended.

The second value in the output is necessary for separating the left and right subtrees of the parse tree. The final function signature is of the form:

#+begin_src c++
pair<Node*, int> prefixToTree(const string& s, int l, int r);
#+end_src

