doc.html

<div id="outline-container-org0ce807d" class="outline-3">
<h3 id="org0ce807d"><span class="section-number-3">1.2.</span> Final function</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ffc777;">string</span> <span style="color: #82aaff;">infixToPrefix</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">string</span> <span style="color: #ff98a4;">s</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
  <span style="color: #ffc777;">stack</span><span style="color: #ff995e;">&lt;</span><span style="color: #ffc777;">char</span><span style="color: #ff995e;">&gt;</span> <span style="color: #ff98a4;">st</span>;
  reverse<span style="color: #ff995e;">(</span>s.begin<span style="color: #ff98a4;">()</span>, s.end<span style="color: #ff98a4;">()</span><span style="color: #ff995e;">)</span>;

  <span style="color: #ffc777;">unordered_map</span><span style="color: #ff995e;">&lt;</span><span style="color: #ffc777;">char</span>, <span style="color: #ffc777;">int</span><span style="color: #ff995e;">&gt;</span> <span style="color: #ff98a4;">operators</span> = <span style="color: #ff995e;">{</span><span style="color: #ff98a4;">{</span><span style="color: #c3e88d;">'&gt;'</span>, 1<span style="color: #ff98a4;">}</span>, <span style="color: #ff98a4;">{</span><span style="color: #c3e88d;">'+'</span>, 2<span style="color: #ff98a4;">}</span>, <span style="color: #ff98a4;">{</span><span style="color: #c3e88d;">'*'</span>, 3<span style="color: #ff98a4;">}</span>, <span style="color: #ff98a4;">{</span><span style="color: #c3e88d;">'~'</span>, 4<span style="color: #ff98a4;">}</span><span style="color: #ff995e;">}</span>;
  <span style="color: #ffc777;">string</span> <span style="color: #ff98a4;">ans</span> = <span style="color: #c3e88d;">""</span>;

  <span style="color: #c099ff;">for</span><span style="color: #ff995e;">(</span><span style="color: #ffc777;">char</span> <span style="color: #ff98a4;">c</span> : s<span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
    <span style="color: #c099ff;">if</span><span style="color: #ff98a4;">(</span>c == <span style="color: #c3e88d;">' '</span><span style="color: #ff98a4;">)</span> <span style="color: #c099ff;">continue</span>;
    <span style="color: #c099ff;">if</span><span style="color: #ff98a4;">(</span>operators.find<span style="color: #b4f9f8;">(</span>c<span style="color: #b4f9f8;">)</span> != operators.end<span style="color: #b4f9f8;">()</span><span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">{</span>
      <span style="color: #c099ff;">if</span><span style="color: #b4f9f8;">(</span>st.empty<span style="color: #f989d3;">()</span> || operators<span style="color: #f989d3;">[</span>c<span style="color: #f989d3;">]</span> &gt; operators<span style="color: #f989d3;">[</span>st.top<span style="color: #ffc777;">()</span><span style="color: #f989d3;">]</span><span style="color: #b4f9f8;">)</span> st.push<span style="color: #b4f9f8;">(</span>c<span style="color: #b4f9f8;">)</span>;
      <span style="color: #c099ff;">else</span> <span style="color: #b4f9f8;">{</span>
        ans.push_back<span style="color: #f989d3;">(</span>st.top<span style="color: #ffc777;">()</span><span style="color: #f989d3;">)</span>;
        st.pop<span style="color: #f989d3;">()</span>;
        st.push<span style="color: #f989d3;">(</span>c<span style="color: #f989d3;">)</span>;
      <span style="color: #b4f9f8;">}</span>
    <span style="color: #ff98a4;">}</span>
    <span style="color: #c099ff;">else</span> <span style="color: #c099ff;">if</span><span style="color: #ff98a4;">(</span>c == <span style="color: #c3e88d;">')'</span><span style="color: #ff98a4;">)</span> st.push<span style="color: #ff98a4;">(</span>c<span style="color: #ff98a4;">)</span>;
    <span style="color: #c099ff;">else</span> <span style="color: #c099ff;">if</span><span style="color: #ff98a4;">(</span>c == <span style="color: #c3e88d;">'('</span><span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">{</span>
      <span style="color: #c099ff;">while</span><span style="color: #b4f9f8;">(</span>st.top<span style="color: #f989d3;">()</span> != <span style="color: #c3e88d;">')'</span><span style="color: #b4f9f8;">)</span> <span style="color: #b4f9f8;">{</span>
        ans.push_back<span style="color: #f989d3;">(</span>st.top<span style="color: #ffc777;">()</span><span style="color: #f989d3;">)</span>;
        st.pop<span style="color: #f989d3;">()</span>;
      <span style="color: #b4f9f8;">}</span>
      st.pop<span style="color: #b4f9f8;">()</span>;
    <span style="color: #ff98a4;">}</span>
    <span style="color: #c099ff;">else</span> ans.push_back<span style="color: #ff98a4;">(</span>c<span style="color: #ff98a4;">)</span>;
  <span style="color: #ff995e;">}</span>

  <span style="color: #c099ff;">while</span><span style="color: #ff995e;">(</span><span style="color: #86e1fc; font-weight: bold;">!</span>st.empty<span style="color: #ff98a4;">()</span><span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
    ans.push_back<span style="color: #ff98a4;">(</span>st.top<span style="color: #b4f9f8;">()</span><span style="color: #ff98a4;">)</span>;
    st.pop<span style="color: #ff98a4;">()</span>;
  <span style="color: #ff995e;">}</span>

  reverse<span style="color: #ff995e;">(</span>ans.begin<span style="color: #ff98a4;">()</span>, ans.end<span style="color: #ff98a4;">()</span><span style="color: #ff995e;">)</span>;
  <span style="color: #c099ff;">return</span> ans;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1b518fa" class="outline-2">
<h2 id="org1b518fa"><span class="section-number-2">2.</span> Converting the prefix expression to a rooted binary parse tree</h2>
<div class="outline-text-2" id="text-2">
<p>
First we define a <code>Node</code> structure to denote the nodes of the binary tree:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Node</span> <span style="color: #c099ff;">{</span>
  <span style="color: #ffc777;">char</span> <span style="color: #ff98a4;">data</span>;
  <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Node</span> *<span style="color: #ff98a4;">left</span>;
  <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Node</span> *<span style="color: #ff98a4;">right</span>;

  <span style="color: #82aaff;">Node</span> <span style="color: #ff995e;">(</span><span style="color: #ffc777;">char</span> <span style="color: #ff98a4;">x</span><span style="color: #ff995e;">)</span> : data<span style="color: #ff995e;">(</span>x<span style="color: #ff995e;">)</span>, left<span style="color: #ff995e;">(</span><span style="color: #ff995e;">nullptr</span><span style="color: #ff995e;">)</span>, right<span style="color: #ff995e;">(</span><span style="color: #ff995e;">nullptr</span><span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{}</span>
<span style="color: #c099ff;">}</span>;
</pre>
</div>

<p>
For actually converting the given prefix expression to a rooted binary parse tree, we're going to employ a recursive algorithm which takes
</p>
<ul class="org-ul">
<li>the prefix expression as a string,</li>
<li>the starting index of the string, and</li>
<li>the ending index of the string</li>
</ul>
<p>
as arguments. 
</p>

<p>
The function is going to return two values:
</p>
<ul class="org-ul">
<li>the root node of the parse tree, and</li>
<li>the index of string where the tree ended.</li>
</ul>

<p>
The second value in the output is necessary for separating the left and right subtrees of the parse tree. The final function signature is of the form:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ffc777;">pair</span><span style="color: #c099ff;">&lt;</span><span style="color: #ffc777;">Node</span>*, <span style="color: #ffc777;">int</span><span style="color: #c099ff;">&gt;</span> <span style="color: #82aaff;">prefixToTree</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">const</span> <span style="color: #ffc777;">string</span>&amp; <span style="color: #ff98a4;">s</span>, <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">l</span>, <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">r</span><span style="color: #c099ff;">)</span>;
</pre>
</div>
</div>
