doc.org
** Algorithm
1. Understanding the base case:
    - If the provided string is empty, return a null pointer:
      #+begin_src c++
        if(l > r) return {nullptr, l};
      #+end_src
    - If the provided string only has a single character, return a new node pointer to it;
      #+begin_src c++
         else if(l == r) 
           return {new Node(s[l]), l};
      #+end_src

2. Initialize a new node pointer pointing to the first character of the string:
   #+begin_src c++
     Node* curr = new Node(s[l]);
   #+end_src

3. If the first character of the string is the *not* operator, then make a recursive call to the remainder of the string and assign the returned node to the right subtree of the root:
   #+begin_src c++
     if(s[l] == '~') {
       auto right = prefixToTree(s, l + 1, r);
       curr->right = right.first;

       return {curr, right.second};
      }
   #+end_src

4. Otherwise, if the first character of the string is any other operator, then make a recursive call to the remainder of the string, assign it to the left subtree of the root. This recursive call is also going to return where the left subtree expression ended in the original string. Use this to recursively obtain the *right* subtree from the expression:
   #+begin_src c++
      else if(s[l] == '*' || s[l] == '+' || s[l] == '>') {
        auto left = prefixToTree(s, l + 1, r);
        curr->left = left.first;

        auto right = prefixToTree(s, left.second + 1, r);
        curr->right = right.first;

        return {curr, right.second};
      }
   #+end_src

5. If the first character of the string is not an operator, then it's just a propositional atom, so just return a new node to it:
   #+begin_src c++
     return {curr, l};
   #+end_src

** Final function
#+begin_src c++
  pair<Node*, int> prefixToTree(const string& s, int l, int r) {
    if(l > r) return {nullptr, l};
    else if(l == r) 
      return {new Node(s[l]), l};

    Node* curr = new Node(s[l]);

    if(s[l] == '~') {
      auto right = prefixToTree(s, l + 1, r);
      curr->right = right.first;

      return {curr, right.second};
    }
    else if(s[l] == '*' || s[l] == '+' || s[l] == '>') {
      auto left = prefixToTree(s, l + 1, r);
      curr->left = left.first;

      auto right = prefixToTree(s, left.second + 1, r);
      curr->right = right.first;

      return {curr, right.second};
    }
    return {curr, l};
  }
#+end_src

* Outputting the infix expression by in-order traversal
In order to obtain the infix expression, we need to perform an in-order traversal of the binary parse tree. This can be done by employing a recursive algorithm:
#+begin_src c++
  void printInorder(Node* head) {
    if(head == nullptr) return;

    printInorder(head->left);
    cout << head->data << ' ';
    printInorder(head->right);
  }
#+end_src

* Computing the height of the parse tree
#+begin_src c++
int height(Node *root) {
  if(root == nullptr) return 0;
  return max(height(root->left), height(root->right)) + 1;
}
#+end_src

