doc.html

<div id="outline-container-orga368723" class="outline-3">
<h3 id="orga368723"><span class="section-number-3">2.1.</span> Algorithm</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Understanding the base case:
<ul class="org-ul">
<li><p>
If the provided string is empty, return a null pointer:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c099ff;">if</span><span style="color: #c099ff;">(</span>l &gt; r<span style="color: #c099ff;">)</span> <span style="color: #c099ff;">return</span> <span style="color: #c099ff;">{</span><span style="color: #ff995e;">nullptr</span>, l<span style="color: #c099ff;">}</span>;
</pre>
</div></li>
<li><p>
If the provided string only has a single character, return a new node pointer to it;
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c099ff;">else</span> <span style="color: #c099ff;">if</span><span style="color: #c099ff;">(</span>l == r<span style="color: #c099ff;">)</span> 
  <span style="color: #c099ff;">return</span> <span style="color: #c099ff;">{</span><span style="color: #c099ff;">new</span> <span style="color: #ffc777;">Node</span><span style="color: #ff995e;">(</span>s<span style="color: #ff98a4;">[</span>l<span style="color: #ff98a4;">]</span><span style="color: #ff995e;">)</span>, l<span style="color: #c099ff;">}</span>;
</pre>
</div></li>
</ul></li>

<li><p>
Initialize a new node pointer pointing to the first character of the string:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ffc777;">Node</span>* <span style="color: #ff98a4;">curr</span> = <span style="color: #c099ff;">new</span> <span style="color: #ffc777;">Node</span><span style="color: #c099ff;">(</span>s<span style="color: #ff995e;">[</span>l<span style="color: #ff995e;">]</span><span style="color: #c099ff;">)</span>;
</pre>
</div></li>

<li><p>
If the first character of the string is the <b>not</b> operator, then make a recursive call to the remainder of the string and assign the returned node to the right subtree of the root:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c099ff;">if</span><span style="color: #c099ff;">(</span>s<span style="color: #ff995e;">[</span>l<span style="color: #ff995e;">]</span> == <span style="color: #c3e88d;">'~'</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
  <span style="color: #c099ff;">auto</span> <span style="color: #ff98a4;">right</span> = prefixToTree<span style="color: #ff995e;">(</span>s, l + 1, r<span style="color: #ff995e;">)</span>;
  curr-&gt;right = right.first;

  <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">{</span>curr, right.second<span style="color: #ff995e;">}</span>;
 <span style="color: #c099ff;">}</span>
</pre>
</div></li>

<li><p>
Otherwise, if the first character of the string is any other operator, then make a recursive call to the remainder of the string, assign it to the left subtree of the root. This recursive call is also going to return where the left subtree expression ended in the original string. Use this to recursively obtain the <b>right</b> subtree from the expression:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c099ff;">else</span> <span style="color: #c099ff;">if</span><span style="color: #c099ff;">(</span>s<span style="color: #ff995e;">[</span>l<span style="color: #ff995e;">]</span> == <span style="color: #c3e88d;">'*'</span> || s<span style="color: #ff995e;">[</span>l<span style="color: #ff995e;">]</span> == <span style="color: #c3e88d;">'+'</span> || s<span style="color: #ff995e;">[</span>l<span style="color: #ff995e;">]</span> == <span style="color: #c3e88d;">'&gt;'</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
  <span style="color: #c099ff;">auto</span> <span style="color: #ff98a4;">left</span> = prefixToTree<span style="color: #ff995e;">(</span>s, l + 1, r<span style="color: #ff995e;">)</span>;
  curr-&gt;left = left.first;

  <span style="color: #c099ff;">auto</span> <span style="color: #ff98a4;">right</span> = prefixToTree<span style="color: #ff995e;">(</span>s, left.second + 1, r<span style="color: #ff995e;">)</span>;
  curr-&gt;right = right.first;

  <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">{</span>curr, right.second<span style="color: #ff995e;">}</span>;
<span style="color: #c099ff;">}</span>
</pre>
</div></li>

<li><p>
If the first character of the string is not an operator, then it's just a propositional atom, so just return a new node to it:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c099ff;">return</span> <span style="color: #c099ff;">{</span>curr, l<span style="color: #c099ff;">}</span>;
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-org180614e" class="outline-3">
<h3 id="org180614e"><span class="section-number-3">2.2.</span> Final function</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ffc777;">pair</span><span style="color: #c099ff;">&lt;</span><span style="color: #ffc777;">Node</span>*, <span style="color: #ffc777;">int</span><span style="color: #c099ff;">&gt;</span> <span style="color: #82aaff;">prefixToTree</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">const</span> <span style="color: #ffc777;">string</span>&amp; <span style="color: #ff98a4;">s</span>, <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">l</span>, <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">r</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
  <span style="color: #c099ff;">if</span><span style="color: #ff995e;">(</span>l &gt; r<span style="color: #ff995e;">)</span> <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">{</span><span style="color: #ff995e;">nullptr</span>, l<span style="color: #ff995e;">}</span>;
  <span style="color: #c099ff;">else</span> <span style="color: #c099ff;">if</span><span style="color: #ff995e;">(</span>l == r<span style="color: #ff995e;">)</span> 
    <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">{</span><span style="color: #c099ff;">new</span> <span style="color: #ffc777;">Node</span><span style="color: #ff98a4;">(</span>s<span style="color: #b4f9f8;">[</span>l<span style="color: #b4f9f8;">]</span><span style="color: #ff98a4;">)</span>, l<span style="color: #ff995e;">}</span>;

  <span style="color: #ffc777;">Node</span>* <span style="color: #ff98a4;">curr</span> = <span style="color: #c099ff;">new</span> <span style="color: #ffc777;">Node</span><span style="color: #ff995e;">(</span>s<span style="color: #ff98a4;">[</span>l<span style="color: #ff98a4;">]</span><span style="color: #ff995e;">)</span>;

  <span style="color: #c099ff;">if</span><span style="color: #ff995e;">(</span>s<span style="color: #ff98a4;">[</span>l<span style="color: #ff98a4;">]</span> == <span style="color: #c3e88d;">'~'</span><span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
    <span style="color: #c099ff;">auto</span> <span style="color: #ff98a4;">right</span> = prefixToTree<span style="color: #ff98a4;">(</span>s, l + 1, r<span style="color: #ff98a4;">)</span>;
    curr-&gt;right = right.first;

    <span style="color: #c099ff;">return</span> <span style="color: #ff98a4;">{</span>curr, right.second<span style="color: #ff98a4;">}</span>;
  <span style="color: #ff995e;">}</span>
  <span style="color: #c099ff;">else</span> <span style="color: #c099ff;">if</span><span style="color: #ff995e;">(</span>s<span style="color: #ff98a4;">[</span>l<span style="color: #ff98a4;">]</span> == <span style="color: #c3e88d;">'*'</span> || s<span style="color: #ff98a4;">[</span>l<span style="color: #ff98a4;">]</span> == <span style="color: #c3e88d;">'+'</span> || s<span style="color: #ff98a4;">[</span>l<span style="color: #ff98a4;">]</span> == <span style="color: #c3e88d;">'&gt;'</span><span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
    <span style="color: #c099ff;">auto</span> <span style="color: #ff98a4;">left</span> = prefixToTree<span style="color: #ff98a4;">(</span>s, l + 1, r<span style="color: #ff98a4;">)</span>;
    curr-&gt;left = left.first;

    <span style="color: #c099ff;">auto</span> <span style="color: #ff98a4;">right</span> = prefixToTree<span style="color: #ff98a4;">(</span>s, left.second + 1, r<span style="color: #ff98a4;">)</span>;
    curr-&gt;right = right.first;

    <span style="color: #c099ff;">return</span> <span style="color: #ff98a4;">{</span>curr, right.second<span style="color: #ff98a4;">}</span>;
  <span style="color: #ff995e;">}</span>
  <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">{</span>curr, l<span style="color: #ff995e;">}</span>;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org23e6647" class="outline-2">
<h2 id="org23e6647"><span class="section-number-2">3.</span> Outputting the infix expression by in-order traversal</h2>
<div class="outline-text-2" id="text-3">
<p>
In order to obtain the infix expression, we need to perform an in-order traversal of the binary parse tree. This can be done by employing a recursive algorithm:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ffc777;">void</span> <span style="color: #82aaff;">printInorder</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">Node</span>* <span style="color: #ff98a4;">head</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
  <span style="color: #c099ff;">if</span><span style="color: #ff995e;">(</span>head == <span style="color: #ff995e;">nullptr</span><span style="color: #ff995e;">)</span> <span style="color: #c099ff;">return</span>;

  printInorder<span style="color: #ff995e;">(</span>head-&gt;left<span style="color: #ff995e;">)</span>;
  cout &lt;&lt; head-&gt;data &lt;&lt; <span style="color: #c3e88d;">' '</span>;
  printInorder<span style="color: #ff995e;">(</span>head-&gt;right<span style="color: #ff995e;">)</span>;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f85ac4" class="outline-2">
<h2 id="org8f85ac4"><span class="section-number-2">4.</span> Computing the height of the parse tree</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ffc777;">int</span> <span style="color: #82aaff;">height</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">Node</span> *<span style="color: #ff98a4;">root</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
  <span style="color: #c099ff;">if</span><span style="color: #ff995e;">(</span>root == <span style="color: #ff995e;">nullptr</span><span style="color: #ff995e;">)</span> <span style="color: #c099ff;">return</span> 0;
  <span style="color: #c099ff;">return</span> max<span style="color: #ff995e;">(</span>height<span style="color: #ff98a4;">(</span>root-&gt;left<span style="color: #ff98a4;">)</span>, height<span style="color: #ff98a4;">(</span>root-&gt;right<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span> + 1;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</div>
