doc.org
* Evaluating the truth value of a propositional logic formula
In order to solve this task, we're going to take a pointer to the root of the parse tree as well as a hashmap of all the variables and their truth values as input. The function is going to evaluate the logical expression and give a truth or false value as output. The function signature is of the form:
#+begin_src c++
  bool evaluate(Node* head, const unordered_map<char, bool>& vals);
#+end_src

** Algorithm
1. If a =null= value is passed as the root node, meaning we're given a tree of height 0, then we just return false.
   #+begin_src c++
     if(head == nullptr) return false;
   #+end_src
2. If the current node is a propositional atom, then we just return its truth value from the hashmap taken as input.
   #+begin_src c++
     if(vals.find(head->data) != vals.end())
       return vals.at(head->data);
   #+end_src
3. Then we just recursively evaluate the left and right subtrees of the parse tree.
   #+begin_src c++
     bool l = evaluate(head->left, vals), r = evaluate(head->right, vals);
   #+end_src
4. If the current node isn't a propositional atom, then it must be an operator. We use a switch statement to match all the operators.
   #+begin_src c++
     switch (head->data) {
      case '~':
        return !r;
        break;
      case '+':
        return l || r;
        break;
      case '*':
        return l && r;
        break;
      case '>':
        return !l || r;
        break;
      default:
        return false;
        break;
      }
   #+end_src

** Final function
#+begin_src c++
  bool evaluate(Node* head, const unordered_map<char, bool>& vals) {
    if(head == nullptr) return false;
    if(vals.find(head->data) != vals.end())
      return vals.at(head->data);

    bool l = evaluate(head->left, vals), r = evaluate(head->right, vals);
    switch (head->data) {
    case '~':
      return !r;
      break;
    case '+':
      return l || r;
      break;
    case '*':
      return l && r;
      break;
    case '>':
      return !l || r;
      break;
    default:
      return false;
      break;
    }
  }
#+end_src
