doc.html

<div id="outline-container-org3577ee9" class="outline-2">
<h2 id="org3577ee9"><span class="section-number-2">5.</span> Evaluating the truth value of a propositional logic formula</h2>
<div class="outline-text-2" id="text-5">
<p>
In order to solve this task, we're going to take a pointer to the root of the parse tree as well as a hashmap of all the variables and their truth values as input. The function is going to evaluate the logical expression and give a truth or false value as output. The function signature is of the form:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ffc777;">bool</span> <span style="color: #82aaff;">evaluate</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">Node</span>* <span style="color: #ff98a4;">head</span>, <span style="color: #c099ff;">const</span> <span style="color: #ffc777;">unordered_map</span><span style="color: #ff995e;">&lt;</span><span style="color: #ffc777;">char</span>, <span style="color: #ffc777;">bool</span><span style="color: #ff995e;">&gt;</span>&amp; <span style="color: #ff98a4;">vals</span><span style="color: #c099ff;">)</span>;
</pre>
</div>
</div>

<div id="outline-container-orgc3c8cf7" class="outline-3">
<h3 id="orgc3c8cf7"><span class="section-number-3">5.1.</span> Algorithm</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li><p>
If a <code>null</code> value is passed as the root node, meaning we're given a tree of height 0, then we just return false.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c099ff;">if</span><span style="color: #c099ff;">(</span>head == <span style="color: #ff995e;">nullptr</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">false</span>;
</pre>
</div></li>
<li><p>
If the current node is a propositional atom, then we just return its truth value from the hashmap taken as input.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c099ff;">if</span><span style="color: #c099ff;">(</span>vals.find<span style="color: #ff995e;">(</span>head-&gt;data<span style="color: #ff995e;">)</span> != vals.end<span style="color: #ff995e;">()</span><span style="color: #c099ff;">)</span>
  <span style="color: #c099ff;">return</span> vals.at<span style="color: #c099ff;">(</span>head-&gt;data<span style="color: #c099ff;">)</span>;
</pre>
</div></li>
<li><p>
Then we just recursively evaluate the left and right subtrees of the parse tree.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ffc777;">bool</span> <span style="color: #ff98a4;">l</span> = evaluate<span style="color: #c099ff;">(</span>head-&gt;left, vals<span style="color: #c099ff;">)</span>, <span style="color: #ff98a4;">r</span> = evaluate<span style="color: #c099ff;">(</span>head-&gt;right, vals<span style="color: #c099ff;">)</span>;
</pre>
</div></li>
<li><p>
If the current node isn't a propositional atom, then it must be an operator. We use a switch statement to match all the operators.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c099ff;">switch</span> <span style="color: #c099ff;">(</span>head-&gt;data<span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
 <span style="color: #c099ff;">case</span> <span style="color: #c3e88d;">'~'</span>:
   <span style="color: #c099ff;">return</span> <span style="color: #86e1fc; font-weight: bold;">!</span>r;
   <span style="color: #c099ff;">break</span>;
 <span style="color: #c099ff;">case</span> <span style="color: #c3e88d;">'+'</span>:
   <span style="color: #c099ff;">return</span> l || r;
   <span style="color: #c099ff;">break</span>;
 <span style="color: #c099ff;">case</span> <span style="color: #c3e88d;">'*'</span>:
   <span style="color: #c099ff;">return</span> l &amp;&amp; r;
   <span style="color: #c099ff;">break</span>;
 <span style="color: #c099ff;">case</span> <span style="color: #c3e88d;">'&gt;'</span>:
   <span style="color: #c099ff;">return</span> <span style="color: #86e1fc; font-weight: bold;">!</span>l || r;
   <span style="color: #c099ff;">break</span>;
 <span style="color: #c099ff;">default</span>:
   <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">false</span>;
   <span style="color: #c099ff;">break</span>;
 <span style="color: #c099ff;">}</span>
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-orgf0e5f20" class="outline-3">
<h3 id="orgf0e5f20"><span class="section-number-3">5.2.</span> Final function</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ffc777;">bool</span> <span style="color: #82aaff;">evaluate</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">Node</span>* <span style="color: #ff98a4;">head</span>, <span style="color: #c099ff;">const</span> <span style="color: #ffc777;">unordered_map</span><span style="color: #ff995e;">&lt;</span><span style="color: #ffc777;">char</span>, <span style="color: #ffc777;">bool</span><span style="color: #ff995e;">&gt;</span>&amp; <span style="color: #ff98a4;">vals</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
  <span style="color: #c099ff;">if</span><span style="color: #ff995e;">(</span>head == <span style="color: #ff995e;">nullptr</span><span style="color: #ff995e;">)</span> <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">false</span>;
  <span style="color: #c099ff;">if</span><span style="color: #ff995e;">(</span>vals.find<span style="color: #ff98a4;">(</span>head-&gt;data<span style="color: #ff98a4;">)</span> != vals.end<span style="color: #ff98a4;">()</span><span style="color: #ff995e;">)</span>
    <span style="color: #c099ff;">return</span> vals.at<span style="color: #ff995e;">(</span>head-&gt;data<span style="color: #ff995e;">)</span>;

  <span style="color: #ffc777;">bool</span> <span style="color: #ff98a4;">l</span> = evaluate<span style="color: #ff995e;">(</span>head-&gt;left, vals<span style="color: #ff995e;">)</span>, <span style="color: #ff98a4;">r</span> = evaluate<span style="color: #ff995e;">(</span>head-&gt;right, vals<span style="color: #ff995e;">)</span>;
  <span style="color: #c099ff;">switch</span> <span style="color: #ff995e;">(</span>head-&gt;data<span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
  <span style="color: #c099ff;">case</span> <span style="color: #c3e88d;">'~'</span>:
    <span style="color: #c099ff;">return</span> <span style="color: #86e1fc; font-weight: bold;">!</span>r;
    <span style="color: #c099ff;">break</span>;
  <span style="color: #c099ff;">case</span> <span style="color: #c3e88d;">'+'</span>:
    <span style="color: #c099ff;">return</span> l || r;
    <span style="color: #c099ff;">break</span>;
  <span style="color: #c099ff;">case</span> <span style="color: #c3e88d;">'*'</span>:
    <span style="color: #c099ff;">return</span> l &amp;&amp; r;
    <span style="color: #c099ff;">break</span>;
  <span style="color: #c099ff;">case</span> <span style="color: #c3e88d;">'&gt;'</span>:
    <span style="color: #c099ff;">return</span> <span style="color: #86e1fc; font-weight: bold;">!</span>l || r;
    <span style="color: #c099ff;">break</span>;
  <span style="color: #c099ff;">default</span>:
    <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">false</span>;
    <span style="color: #c099ff;">break</span>;
  <span style="color: #ff995e;">}</span>
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-10-09 Sun 09:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
